lib/tasks/dev.rake

INSERT INTO `students` (`name`, `matricula`, `email`, `password`, `password_confirmation`, `created_at`, `updated_at`) VALUES ('Allana', '215031119', 'allana@uff.br', '123456', '123456', '2019-03-25 16:09:55', '2019-03-25 16:09:55')
---
  task add_default_student: :environment do
    Student.create!(
        matricula: '215031119',
        name: 'Allana',
        email: 'allana@uff.br',
        password: DEFAULT_PASSWORD,
        password_confirmation: DEFAULT_PASSWORD
    )

INSERT INTO `students` (`name`, `matricula`, `email`, `password`, `password_confirmation`, `created_at`, `updated_at`) VALUES ('Ana Clara Limeira Neto', '227849761', 'limeira_neto_clara_ana@bol.com.br', '123456', '123456', '2019-03-25 16:09:56', '2019-03-25 16:09:56')
---
  task add_extra_student: :environment do
    10.times do |i|
      nome = Faker::Name.name
      Student.create!(
          matricula: Faker::Number.number(9),
          name: nome,
          email: Faker::Internet.free_email(nome).split("@")[0]+"@uff.br",
          password: DEFAULT_PASSWORD,
          password_confirmation: DEFAULT_PASSWORD
      )