app/controllers/student_controller.rb

  def index
    @students = Student.all.page(params[:page])
---
SELECT  `students`.* FROM `students` LIMIT 11