app/controllers/students_controller.rb

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 3 LIMIT 1
---
  def get_mat
    @student = Student.find[params[:matricula]]

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 3 LIMIT 1
---
    def set_student
      @student = Student.find(params[:id])